# int(მთელი რიცხვი)
# float(ციფრი მაგ: 3,2)

# არითმეტიკული ოპერაციები
print(1 + 1)    # მიმატება
print(3 - 1)    # გამოკლება
print(4 * 2)    # გამრავლება
print(10 / 2)   # გაყოფა
print(2 ** 4)   # ახარისხება
print(10 // 3)  # მხოლოდ მთელი მხარე წერტილამდე
print(10 % 3 )  # ნაშთის გაგება

# მინიჭების ოპერატორები
x = 7    #  მინიჭება
x = x+2  #  იგივეა რაც შემდეგ ხაზზე
x += 2   #  ანალოგიურად სრულდება ყველა ოპერატორზე
x -= 1   #  ------
print(x)

# შედარების ოპერატორები
print(3 > 2  )# true
print(4 < 5  )# true
print(3 >= 0 )# true    3 მეტია ან უდრის 0ს
print(7 <= 2 )# false   7 ნაკლებია ან უდრის 2ს
print(4 == 4 )# true
print(7 != 9 )# true    7 არ უდრის ცხრას

#ლოგიკური ოპერაციები 
         # პითონის ლოგიკა andის და orის შემთხვევაში
#   AND                 OR
# 0 and 0 -> 0        0 or 0 -> 0
# 0 and 1 -> 0        0 or 1 -> 1
# 1 and 0 -> 0        1 or 0 -> 1
# 1 and 1 -> 1        1 or 1 -> 1
a = True
b = 2
print(a and b) # false
print(a or b)  # true
print(not a)   # false
print(b != 2)   # true
#თავისებურება
x1 = 7
y2 = 6
print(x1 and y2) # პასუხს აბრუნებს ბოლო ჭეშმარიტებას
print(x1 or y2 ) # პასუხს აბრუნებს პირველ ჭეშმარიტებას

# სპეციალური ოპერატორები
#  ==,   
a1 = 258
b1 = 258
string = "georgia"

print( id(a1), id(b1) ) # კითხვა ლექტორთან 
print("o" in string)      # true
print("k" not in string)  # true
print("k" in string)      # false
2*2**3 # პირველი სრულდება ახარისხება და შემდეგ გამრავლება
 