#ფაილებთან მუშაობა

#რეჟიმები
# "r" - read
# "W" - write
# "a" - append
# "b" - binary
# "+" - read and wrtie

# "rb" - read binary
# "Wb" - write binary

# "r+" - read and write

# #read წაიკითხავს მთლიანად ან რამდენ სიმბოლოსაც მივუთითებთ იდენს
# f=open("text1.txt", "r")            
# print(f.read(1)) #წაიკითხავს პირველ სიმბოლოს
# print(f.read(3)) #კითხვას გააგრძელებს მეორე სიმბოლოდან და წაიკითხავს 3 სიმბოლოს

# f.close() # უნდა დავხუროთ ოპტიმიზაციისთვის

# #readline  სტრიქონისთვის, ყოველ ახალ გამოძახებაზე კითხულობს სტრიქონ-სრიქონ
# t=open("text1.txt","r")
# print(t.readline()) # წაოლოთხავს პირველ სტრიქონს
# print(t.readline()) # კითხვას გააგრძელებს შემდეგი სტრიქონიდან
# t.close()

#readlines გამოიტანს სიებს []
t=open("text1.txt","r")
print(t.readlines()) # წაიკითხავს ყველა ლაინს და გამოიტანს სიებს
print(t.readlines()) # ცარიელი იქნება []
t.close()

# ჩაწერის რეჟიმი write "w"
f = open("text2.txt", "w") # "w" რეჟიმი შეამოწმებს თუ არსებობს ფაილს, თუ არ არსებობს შექმნის
f.write ("Hello Georgia!")  # შეიტანს ინფორმაციას, თუ ფაილში უკვე არის ინფორმაცია არ დაუმატებს არამედ გადააწერს თავზე
f.close()

# არსებულ ინფორმაციაზე მიმატებისთვის გამოიყენება "a" - append რეჟიმი
f=open("text2.txt", "a")
f.write("\nHello World!") # \n-სლეშ-ენ არის შემდეგ სტრიქონზე გადასვლის ბრძანება
f.close()

# "rb" - read binary & "Wb" - write binary ბინარულ ფაილებთან მუშაობა, რომელიც გამოიყენება არატექსტური ინფორმაციისთვის
fb1=open("moon.jpg", "rb")     #ცვლადს მიენიჭოს გახსნას მითითებული ბინარული ფაილი "სურათი"
fb2=open("moonCopy.jpg", "wb") #ცვლადს მიენიჭოს მითითებული დასახელებით ბინარული ფაილის შექმნის პირობა "სურათი"
fb2.write(fb1.read()) #შეიქმნას fb2=ცვლადში fb1-ცვლადის მნიშვნელობა. ანუ დაკოპირდეს ფაილი წინასწარ განსაზღვრული სახელით
fb1.close() #დაიხაუროს 
fb2.close() #დაიხაუროს 

#  "r+" - read and write წაიკითხოს და დაემატოს
f=open("text2.txt","r+")  
print(f.read())
f.write("\nHello earth!")
f.close()

# კონტექსტის მენეჯერი with... as....    არის შემოკებული კონტრუქცია იგივე ფუნქციებით
with open ("text2.txt", "r") as f: # ამ კონსტრუქციას ფაილის დახურვის ოპერაცია არ სჭირდება 
    print(f.read())                # შეწეულ/დაქვემდებარებულ კოდს ეწოდება "კონტექსტის მენეჯერი " 