# საშინაო დავალება 
# 1. დაწერე პროგრამა რომელიც გკითხავს ჯერ სახელს, შემდეგ გვარს და გამოიტანს ორივეს ერთად ტერმინალში შემდეგი ფორმატით:
# გიორგი აბრამია
Fname = input("შეიყვანეთ სახელი: ")
Lname = input("შეიყვანეთ გვარი: ")
print(Fname, Lname)

# 2.	დაწერე პროგრამა რომელიც გკითხავს ორ რიცხვს. აიყვანს პირველ რიცხვს მეორე რიცხვის ხარისხში და გამოიტანს შედეგს ტერმინალში.
number1 = int(input("შეიყვანეთ რიცხვი: "))
number2 = int(input("შეიყვანეთ ხარისხი: "))
print(number1**number2)

# 3.	დაწერე პროგრამა რომელიც გკითხავს სახელს, გვარს, ასაკს და ქალაქს. შეინახავს ინფორმაციას და გამოიტანს ტერმინალში რეზუმეს შენს შესახებ შემდეგი ფორმატით:
Fname = input("შეიყვანეთ სახელი: ")
Lname = input("შეიყვანეთ გვარი: ")
Age   = input("შეიყვანეთ ასაკი: ")
City  = input("შეიყვანეთ ქალაქი: ")
print("სახელი:", Fname)
print("გვარი:", Lname)
print("ასაკი:", Age)
print("ქალაქი:", City)
# სახელი: ლია
# გვარი: ქებაძე
# ასაკი: 20
# ქალაქი: თბილისი

# 4.	პროგრამა გთხოვს სამჯერ შეიყვანო ხილის სამი სახეობა. შედეგი კი ბრუნდება შემდეგ ფორმატში:
# მაგ. ვაშლი//ატამი%%ფორთოხალი
a=input("შეიყვანეთ ხილი1: ")
b=input("შეიყვანეთ ხილი2: ")
c=input("შეიყვანეთ ხილი3: ")
print(a, end="//") 
print(b, end="%%")
print(c)
# 5.	პროგრამა გთხოვს შეიყვანო ტექსტი და აბრუნებს ტექსტში არსებული სიმბოლოების რაოდენობას შემდეგი ფორმატით:
# Number of symbols: 50
string = input("შეიყვანეთ ტექსტი: ")
print("Number of symbols:",len(string))
