# ვიქტორინა
answer = input("რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?\n1. შუმერთა\n2. სელჩუკთა\n3. რომის \n 4. მონღოლთა\n შეიყვანეთ პასუხი: ")
if answer == "3" or answer=="რომის" or "რომი":
    print("სწორია!")
else:
    print("არა! სწორი პასუხია რომის!")

# ონლაინ მაღაზია
categories = input("აირჩიეთ კატეგორია\n1. ლეპტოპები\n2. პერსონალური კომპიუტერები\n3. მობილურები")
if categories=="1" or categories=="ლეპტოპები":
    leptop_budget=int(input("შეიყვანეთ მაქსიმალური ბიუჯეტი: "))
    laptob_a="ლეპტობი A. ფასი: 1150 ლარი"
    laptob_b="ლეპტოპი B. ფასი: 1300 ლარი"
    laptob_c="ლეპტოპი C. ფასი: 1500 ლარი"
    if leptop_budget >= 1150:
        print(laptob_a)
    if leptop_budget >= 1300:
        print(laptob_b)
    if leptop_budget >= 1500:
        print(laptob_c)
    if leptop_budget < 1150:
        print("ამ თანხაში შეთავაზება არ არის")
if categories=="2" or categories=="პერსონალური კომპიუტერები":
    pc_budget=int(input("შეიყვანეთ მაქსიმალური ბიუჯეტი: "))
    pc_a="პერსონალური კომპიუტერი A. ფასი: 2450 ლარი"
    pc_b="პერსონალური კომპიუტერი B. ფასი: 3340 ლარი"
    pc_c="პერსონალური კომპიუტერი C. ფასი: 5000 ლარი"
    if pc_budget>=2450:
        print(pc_a)
    if pc_budget>=3340:
        print(pc_b)
    if pc_budget>=5000:
        print(pc_c)
    if pc_budget<2450:
        print("ამ თანხაში შეთავაზება არ არის")
if categories=="3" or categories=="მობილურები":
    mobile_budget=int(input("შეიყვანეთ მაქსიმალური ბიუჯეტი: "))
    mobile_a="მობილური A. ფასი: 950 ლარი"
    mobile_b="მობილური B. ფასი: 1499 ლარი"
    mobile_c="მობილური C. ფასი: 2900 ლარი"
    if mobile_budget>=950:
        print(mobile_a)
    if mobile_budget>=1499:
        print(mobile_b)
    if mobile_budget>=2900:
        print(mobile_c)
    if mobile_budget<950:
        print("ამ თანხაში შეთავაზება არ არის")
        
# შტორმი 
petrol=int(input("შეიყვანეთ რამდენი საწვავი გაქვთ: "))
km_calc = petrol/12
km = int(km_calc)  # ვივარაუდე რომ ამ ეტაპზე არ ვაკეთებთ ათწილადებში გამოთვლას. ამიტომ შედეგი გადავიყვანე  მთელ რიცხვად
if km >= 50:
    print("Zaragoza (50km)")
if km >= 75:
    print("Valencia (75 km)")
if km >= 100:
    print("Madrid (100km)")
if km <50:
    print("!ავარიული დაშვება!")

# მომხმარებლისთვის კარიერის შერჩევა

a=input("რომელ საგანს სწავლობდი ყველაზე კარგად სკოლაში?\n1. მათემატიკას\n2. ისტორიას\n შეიყვანეთ მხოლოდ პასუხის ნომერი: ")
b=input("ლაპარაკი გირჩევნია თუ მოსმენა?\n1. ლაპარაკი\n2. მოსმენა\n შეიყვანეთ მხოლოდ პასუხის ნომერი:  ")
c=input("როგორ გარემოში გირჩევნია მუშაობა?\n1. დისტანციურად მუშაობა მირჩევნია\n2. მთავარია კაბინეტი მქონდეს\n შეიყვანეთ მხოლოდ პასუხის ნომერი:  ")
if a=="1" and b=="1" and c=="1":
    print("თქვენი პროფესიაა: პროფესია A")
elif a=="2" and b=="2" and c=="2":
    print("თქვენი პროფესიაა: პროფესია B")
elif a=="2" and b=="1" and c=="1":
    print("თქვენი პროფესიაა: პროფესია C")
elif a=="1" and b=="2" and c=="1":
    print("თქვენი პროფესიაა: პროფესია D")
elif a=="1" and b=="1" and c=="2":
    print("თქვენი პროფესიაა: პროფესია A1")
elif a=="1" and b=="2" and c=="2":
    print("თქვენი პროფესიაა: პროფესია B1")
elif a=="2" and b=="1" and c=="2":
    print("თქვენი პროფესიაა: პროფესია C1")
elif a=="2" and b=="2" and c=="1":
    print("თქვენი პროფესიაა: პროფესია D1")
else:
    print("გთოხვთ სოწრად შეიყვანოთ პასუხი")







    

